maxboss10086/max_dsp/max/F28388D/8_clb_endat_clk/device/driverlib/inc/hw_hrpwm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the DCAHTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCAHTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCAH
                                               // Mux
#define HRPWM_DCAHTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCAH
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the DCALTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCALTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCAL
                                               // Mux
#define HRPWM_DCALTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCAL
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the DCBHTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCBHTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCBH
                                               // Mux
#define HRPWM_DCBHTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCBH
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the DCBLTRIPSEL register
//
//*****************************************************************************
#define HRPWM_DCBLTRIPSEL_TRIPINPUT1  0x1U         // Trip Input 1 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT2  0x2U         // Trip Input 2 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT3  0x4U         // Trip Input 3 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT4  0x8U         // Trip Input 4 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT5  0x10U        // Trip Input 5 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT6  0x20U        // Trip Input 6 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT7  0x40U        // Trip Input 7 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT8  0x80U        // Trip Input 8 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT9  0x100U       // Trip Input 9 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT10  0x200U       // Trip Input 10 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT11  0x400U       // Trip Input 11 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT12  0x800U       // Trip Input 12 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT14  0x2000U      // Trip Input 14 Select to DCBL
                                               // Mux
#define HRPWM_DCBLTRIPSEL_TRIPINPUT15  0x4000U      // Trip Input 15 Select to DCBL
                                               // Mux

//*****************************************************************************
//
// The following are defines for the bit fields in the EPWMLOCK register
//
//*****************************************************************************
#define HRPWM_EPWMLOCK_HRLOCK     0x1U         // HRPWM Register Set Lock
#define HRPWM_EPWMLOCK_GLLOCK     0x2U         // Global Load Register Set Lock
#define HRPWM_EPWMLOCK_TZCFGLOCK  0x4U         // TripZone Register Set Lock
#define HRPWM_EPWMLOCK_TZCLRLOCK  0x8U         // TripZone Clear Register Set
                                               // Lock
#define HRPWM_EPWMLOCK_DCLOCK     0x10U        // Digital Compare Register Set
                                               // Lock
#define HRPWM_EPWMLOCK_KEY_S      16U
#define HRPWM_EPWMLOCK_KEY_M      0xFFFF0000U  // Key to write to this register
#endif
